src/cf/InformationRegisters/ВерсииСогласованныхФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВерсииСогласованныхФайлов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВизаСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВизыСогласования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ВизыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВизыСогласования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПомещенияВИсторию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУчастника</Name>
					<Comment>Идентификатор участника действия</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияСогласования</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.Согласование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИтерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоместилВИсторию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомещенаВИсторию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановилРезультат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФактическиеИсполнители</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/РаботаСВизамиСогласованияКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет проверки перед началом добавления визы
//
Процедура ДобавитьВизу(ЭтаФорма) Экспорт 
	
	Документ = ЭтаФорма.Объект;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ЭтаФорма", ЭтаФорма);
	ПараметрыОповещения.Вставить("Документ", Документ);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ДобавитьВизуПродолжение",
		ЭтотОбъект,
		ПараметрыОповещения);

	Если Не ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		ТекстВопроса = НСтр("ru = 'Для добавления визы согласования необходимо записать документ.
			|Выполнить запись?'");
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе 
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.ОК);
	КонецЕсли;
		
КонецПроцедуры

Процедура ДобавитьВизуПродолжение(Результат, Параметры) Экспорт 

	Документ = Параметры.Документ;
	ЭтаФорма = Параметры.ЭтаФорма;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда 	
		
		Если Не ЭтаФорма.Записать() Тогда 
			Возврат;
		КонецЕсли;
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Создание:'"), 
			ПолучитьНавигационнуюСсылку(Документ.Ссылка),
			Строка(Документ.Ссылка),
			БиблиотекаКартинок.Информация32);	
	КонецЕсли;	

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ", Документ.Ссылка);
	ОткрытьФорму("Справочник.ВизыСогласования.Форма.ФормаЭлемента", ПараметрыФормы, Параметры.ЭтаФорма);
	
КонецПроцедуры

// Выполняет проверки перед началом изменения визы
//
Процедура ИзменитьВизу(ЭтаФорма) Экспорт 
	
	Виза = ЭтаФорма.Элементы.ВизыСогласования.ТекущиеДанные;
	Документ = ЭтаФорма.Объект;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ЭтаФорма", ЭтаФорма);
	ПараметрыОповещения.Вставить("Документ", Документ);
	ПараметрыОповещения.Вставить("Виза", Виза);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ИзменитьВизуПродолжение",
		ЭтотОбъект,
		ПараметрыОповещения);

	Если Не ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		
		ИндексВыбраннойВизы = ЭтаФорма.Элементы.ВизыСогласования.ВыделенныеСтроки[0];
		
		ТекстВопроса = НСтр("ru = 'Для изменения визы согласования необходимо записать документ.
			|Выполнить запись?'");
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе 
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.ОК);
	КонецЕсли;
		
КонецПроцедуры	

Процедура ИзменитьВизуПродолжение(Результат, Параметры) Экспорт 

	Документ = Параметры.Документ;
	ЭтаФорма = Параметры.ЭтаФорма;
	Виза = Параметры.Виза;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда 	
		
		Если Не ЭтаФорма.Записать() Тогда 
			Возврат;
		КонецЕсли;
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Создание:'"), 
			ПолучитьНавигационнуюСсылку(Документ.Ссылка),
			Строка(Документ.Ссылка),
			БиблиотекаКартинок.Информация32);	
	КонецЕсли;	

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Виза.Ссылка);
	ПараметрыФормы.Вставить("Документ", Документ.Ссылка);
	ОткрытьФорму("Справочник.ВизыСогласования.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

// Возвращает структуру реквизитов визы, которые будут подписаны
//
Функция ПолучитьСтруктуруВизДляПодписания() Экспорт
	
	Возврат Новый Структура("Документ,
		|ДатаИсполнения,
		|РезультатСогласования,
		|Исполнитель");
	
КонецФункции

// Открывает форму версий согласованных файлов по навигационной ссылке на визу
// 
// Параметры:
//  НавигационнаяСсылка - Строка - Навигационная ссылка на визу согласования
//  Форма - ФормаКлиентскогоПриложения - Форма-владелец из которой вызывается открытие списка версий
Процедура ОткрытьВерсииСогласованныхФайловПоСсылке(НавигационнаяСсылка, Форма) Экспорт
	
	ВизаСогласования = РаботаС_HTMLВызовСервера.СсылкаПоНавигационной(НавигационнаяСсылка);
	Если Не ЗначениеЗаполнено(ВизаСогласования) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ВизаСогласования", ВизаСогласования);
	ОткрытьФорму("РегистрСведений.ВерсииСогласованныхФайлов.Форма.ВерсииСогласованныхФайловПоВизе",
		ПараметрыОткрытия, Форма);
	
КонецПроцедуры

#КонецОбласти
